//============================================================================
// 공용설정
//----------------------------------------------------------------------------
// Name        = 명칭, 설정시 구분용
// ScannerType = 0:Hilscher (현재 1개만 구현) 
// ScanTime    = 폴링시간(업데이트시간) (ms)
// NumInput    = 입력점점 수
// NumOutput   = 출력접점 수 
// IpStartAddr = 출력접점 시작 어드레스 (보드가 여러장일때)
// OpStartAddr = 출력접점 시작 어드레스 (보드가 여러장일때)
// Simulate    = 0:Real, 1:Simulation
//
//============================================================================
// Hilscher Scanner
//----------------------------------------------------------------------------
// DeviceNum   = 
//

[General]

[Settings]
NumScanner      = 1
Simulate        = 1


[Scanner0]
Name            = "Hilscher Scanner"
ScannerType     = 0
ScanTime        = 50
NumInput        = 80
NumOutput       = 80
IpStartAddr     = 1000
OpStartAddr     = 1000

DeviceNum       = 0
Simulate        = 1
